<?php
//Дан массив А(N). Получить массив В(N), i-элемент которого равен среднему арифметическому
//первых i элементов массива А.

function task($A){
    $B = [];
    for($i =0; $i < count($A); $i++){
        $sum = 0;
        if($i == 0){
            $B[$i] = $A[0];
        }else{
            for($j = 0; $j <= $i; $j++){
                $sum +=$A[$j];
                $B[$i] = $sum/($i+1);
            }
        }

    }
    echo "<pre>";
    var_dump($B);
    echo "</pre>";
}

$arr = [2,6,4,3,-3,2,-7,11,7,2,3];

task($arr);
