<?php
//Получить упорядоченный по возрастанию массив С(К) путем слияния двух порядоченных по
//возрастанию массивов А(N) и В(М), где К=М+N.

function sliyanie($A,$B){
    $C = [];
    for($i=0; $i<count($A); $i++){
        $C[] = $A[$i];
    }
    for($j = 0; $j<count($B); $j++){
        $C[] = $B[$j];
    }
    for( $k=0; $k < count($C); $k++) {
        for ($d = count($C) - 1; $d > $k; $d--) {
            if ($C[$d - 1] > $C[$d]) {
                $x = $C[$d - 1];
                $C[$d - 1] = $C[$d];
                $C[$d] = $x;
            }
        }
    }
    return $C;
}

$arr = [1,3,4,5,7,11,15,17,18,22,25,26,27,30];
$insert_arr = [2,5,8,9,12,15,19,28];

print_r(sliyanie($arr, $insert_arr));
